<h1>Normalisation</h1>

In [35]:
import sqlalchemy
sqlalchemy.create_engine('postgresql://dbadmin:pw123@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox')
#%load_ext sql
%reload_ext sql
%sql postgresql://dbadmin:pw123@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox

<h3>Definitions</h3>
<DL>
<DT><strong>functional dependency</strong></DT>
<DD>&#8594; A functional dependency exists when the value of one or more attributes determines the value of another attribute<br>
&#8594; "If I tell you one specific fact, can you respond with a unique associated fact?"
</DD>
<DT><strong>key</strong></DT>
<DD>&#8594; A key is a combination of one or more columns that is used to identify particular rows in a relation</DD>
<DT><strong>composite keys</strong></DT>
<DD>&#8594; Keys that have two or more columns are called composite keys.</DD>
<DT><strong>candidate key</strong></DT>
<DD>&#8594; A candidate key is a determinant that determines all of the other columns in a relation.</DD>
<DD>&#8594; Candidate keys identify a unique row in a relation</DD>
<DD>&#8594; Given the value of a candidate key, we can find one and only one row in the relation that has that value</DD>
<DT><strong>primary key</strong></DT>
<DD>&#8594; When designing a database, one of the candidate keys is selected to be the primary key.</DD>
<DD>&#8594; The DBMS will use it as its primary means for finding rows in a table.</DD>
<DT><strong>surrogate key</strong></DT>
<DD>&#8594; A surrogate key is an artificial column that is added to a table to serve as the primary key.</DD>
<DD>&#8594; The DBMS assigns a unique value to a surrogate key when the row is created. The assigned value never changes.</DD>
<DD>&#8594; Surrogate keys are used when the primary key is a composite key of many attributes or missing</DD>
<DT><strong>foreign key</strong></DT>
<DD>&#8594; A foreign key is a column or composite of columns that is the primary key of a table other than the one in which it appears.</DD>
</DL>

<h3>Relation</h3>
<p>
A table is a relation, when the criteria of the following definition are met.
</p>
<p><b>Characteristics of Relations:</b></p>
<ul>
    <li>Rows contain data about an entity.</li>
    <li>Columns contain data about attributes of the entities.</li>
    <li>All entries in a column are of the same kind.</li>
    <li>Each column has a unique name.</li>
    <li>Cells of the table hold a single value.</li>
    <li>The order of the columns is unimportant.</li>
    <li>The order of the rows is unimportant.</li>
    <li>No two rows may be identical.</li>
</ul>

<h2>Step by step guide</h2>
<p>
2NF, 3NF, and BCNF are all concerned with anomalies that are caused by functional dependencies. A relation that is in BCNF has no modification anomalies from functional dependencies. It is also automatically in 2NF and 3NF, and, therefore, we will focus on transforming relations into BCNF. 
</p>
<h3>First Normal Form (1NF)</h3>
<ol>
    <li>Meets the set of conditions for a relation</li>
    <li>Has a defined primary key.</li>
    <li>Repeating groups are not permitted.</li>
</ol>
<h3>Second Normal Form (2NF)</h3>
<ol>
    <li>Meets the conditions of 1NF</li>
    <li>All non-key attributes are determined by the entire primary key</li>
    <li>If you have a relation R (<u>A</u>, <u>B</u>, N, O, P) with the composite key (A, B), then none of the non-key attributes N, O, or P can be determined by just A or just B.</li>
    <li>Relations with single-attribute primary keys are automatically in 2NF</li>
</ol>
<h3>Example</h3>

In [36]:
%%sql
DROP TABLE IF EXISTS STUDENT_ACTIVITY;

CREATE TABLE STUDENT_ACTIVITY
(
	"StudentID"			INT,
	"Activity" 			VARCHAR(30),
	"ActivityFee"		DECIMAL(5,2),
	CONSTRAINT			STUDENT_ACTIVITY_PK			PRIMARY KEY("StudentID", "Activity")
);

INSERT INTO STUDENT_ACTIVITY (
	"StudentID",
	"Activity",
	"ActivityFee"
)
VALUES
(100, 'Golf', 65.00),
(100, 'Skiing', 200.00),
(200, 'Skiing', 200.00),
(200, 'Swimming', 50.00),
(300, 'Skiing', 200.00),
(300, 'Swimming', 50.00),
(400, 'Golf', 65.00),
(400, 'Swimming', 50.00);

SELECT * FROM STUDENT_ACTIVITY;

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
Done.
8 rows affected.
8 rows affected.

[(100, 'Golf', Decimal('65.00')),
 (100, 'Skiing', Decimal('200.00')),
 (200, 'Skiing', Decimal('200.00')),
 (200, 'Swimming', Decimal('50.00')),
 (300, 'Skiing', Decimal('200.00')),
 (300, 'Swimming', Decimal('50.00')),
 (400, 'Golf', Decimal('65.00')),
 (400, 'Swimming', Decimal('50.00'))]


STUDENT_ACTIVITY has the composite primary key (StudentID, Activity), which allows us to determine the fee a particular student will have to pay for a particular activity. However, because fees are determined by activities, ActivityFee is also functionally dependent on just Activity itself, and we can say that ActivityFee is partially dependent on the key of the table. The set of functional dependencies is therefore:<br>
(StudentID, Activity) &#8594; ActivityFee<br>
Activity &#8594; ActivityFee
</p>
<p>
We will have to move the columns of the functional dependency based on the partial primary key attribute into a separate relation while leaving the determinant in the original relation as a foreign key. We will end up with two relations:<br>
STUDENT_ACTIVITY (StudentID, Activity)<br>
ACTIVITY_FEE (Activity, ActivityFee)
</p>

In [37]:
%%sql
DROP TABLE IF EXISTS ACTIVITY_FEE CASCADE;
SELECT DISTINCT
"Activity",
"ActivityFee"
INTO ACTIVITY_FEE
FROM STUDENT_ACTIVITY;

ALTER TABLE ACTIVITY_FEE 
    ADD CONSTRAINT ACTIVITY_FEE_PK 
        PRIMARY KEY("Activity");

SELECT * FROM ACTIVITY_FEE;

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
3 rows affected.
Done.
3 rows affected.

[('Skiing', Decimal('200.00')),
 ('Swimming', Decimal('50.00')),
 ('Golf', Decimal('65.00'))]

In [38]:
%%sql
DROP TABLE IF EXISTS NEW_STUDENT_ACTIVITY;

SELECT DISTINCT
"StudentID",
"Activity"
INTO NEW_STUDENT_ACTIVITY
FROM STUDENT_ACTIVITY;

ALTER TABLE NEW_STUDENT_ACTIVITY
    ADD CONSTRAINT NEW_STUDENT_ACTIVITY_PK 
        PRIMARY KEY("StudentID","Activity");

ALTER TABLE NEW_STUDENT_ACTIVITY 
    ADD CONSTRAINT NEW_STUDENT_ACTIVITY_FK 
        FOREIGN KEY("Activity")
        REFERENCES ACTIVITY_FEE("Activity");

SELECT * FROM NEW_STUDENT_ACTIVITY;

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
8 rows affected.
Done.
Done.
8 rows affected.

[(200, 'Swimming'),
 (200, 'Skiing'),
 (300, 'Swimming'),
 (300, 'Skiing'),
 (400, 'Swimming'),
 (100, 'Golf'),
 (400, 'Golf'),
 (100, 'Skiing')]

<h3>Third Normal Form (3NF)</h3>
<ol>
    <li>Meets the conditions of 2NF</li>
    <li>A relation is in 3NF if there are no non-key attributes determined by another non-key attribute</li>
    <li>The technical name for a non-key attribute determined by another non-key attribute is transitive dependency.</li>
    <li>In order for our relation R (<u>A</u>, <u>B</u>, N, O, P) to be in 3NF, none of the non-key attributes N, O, or P can be determined by N, O, or P</li>
</ol>
<h3>Example STUDENT_HOUSING</h3>

In [39]:
%%sql
DROP TABLE IF EXISTS STUDENT_HOUSING;

CREATE TABLE STUDENT_HOUSING
(
	"StudentID"			INT,
	"Building" 			VARCHAR(30),
	"BuildingFee"		DECIMAL(6,2),
	CONSTRAINT			STUDENT_HOUSING_PK			PRIMARY KEY("StudentID")
);
INSERT INTO STUDENT_HOUSING (
	"StudentID",
	"Building",
	"BuildingFee"
);
VALUES
(100, 'Randoplh', 3200.00),
(200, 'Ingersoll', 3400.00),
(300, 'Randoplh', 3200.00),
(400, 'Randoplh', 3200.00),
(500, 'Pitkin', 3500.00),
(600, 'Ingersoll', 3400.00),
(700, 'Ingersoll', 3400.00),
(800, 'Pitkin', 3500.00);

SELECT * FROM STUDENT_HOUSING;

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
Done.
8 rows affected.
8 rows affected.

[(100, 'Randoplh', Decimal('3200.00')),
 (200, 'Ingersoll', Decimal('3400.00')),
 (300, 'Randoplh', Decimal('3200.00')),
 (400, 'Randoplh', Decimal('3200.00')),
 (500, 'Pitkin', Decimal('3500.00')),
 (600, 'Ingersoll', Decimal('3400.00')),
 (700, 'Ingersoll', Decimal('3400.00')),
 (800, 'Pitkin', Decimal('3500.00'))]

<p>
The STUDENT_HOUSING relation is in 2NF, and the table schema is:<br><br>
STUDENT_HOUSING (<u>StudentID</u>, Building, BuildingFee)<br><br>
Here we have a single-attribute primary key, StudentID, so the relation is in 2NF because there is no possibility of a non-key attribute being dependent on only part of the primary key. Furthermore, if we know the student, we can determine the building where he or she is residing, so:<br><br>
StudentID &#8594; Building<br><br>
However, the building fee is independent of which student is housed in the building, and, in fact, the same fee is charged for every room in a building. Therefore, Building determines BuildingFee:<br><br>
Building &#8594; BuildingFee<br><br>
Thus, a non-key attribute (BuildingFee) is functionally determined by another non-key attribute (Building), and the relation is not in 3NF.
To put the relation into 3NF, we will have to move the columns of the functional dependency into a separate relation while leaving the determinant in the original relation as a foreign key. We will end up with two relations:<br><br>
STUDENT_HOUSING (<u>StudentID</u>, Building)<br>
BUILDING_FEE (<u>Building</u>, BuildingFee)<br><br>
The Building column in STUDENT_HOUSING becomes a foreign key. The two relations are now in 3NF.
</p>

In [40]:
%%sql
DROP TABLE IF EXISTS BUILDING_FEE CASCADE;

SELECT DISTINCT
"Building",
"BuildingFee"
INTO BUILDING_FEE
FROM STUDENT_HOUSING;

ALTER TABLE BUILDING_FEE 
    ADD CONSTRAINT BUILDING_FEE_PK 
        PRIMARY KEY("Building");

SELECT * FROM BUILDING_FEE;

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
3 rows affected.
Done.
3 rows affected.

[('Ingersoll', Decimal('3400.00')),
 ('Randoplh', Decimal('3200.00')),
 ('Pitkin', Decimal('3500.00'))]

In [41]:
%%sql
DROP TABLE IF EXISTS NEW_STUDENT_HOUSING;

SELECT DISTINCT
"StudentID",
"Building"
INTO NEW_STUDENT_HOUSING
FROM STUDENT_HOUSING;

ALTER TABLE NEW_STUDENT_HOUSING
    ADD CONSTRAINT NEW_STUDENT_HOUSING_PK 
        PRIMARY KEY("StudentID");

ALTER TABLE NEW_STUDENT_HOUSING
    ADD CONSTRAINT NEW_STUDENT_HOUSING_FK 
        FOREIGN KEY("Building")
        REFERENCES BUILDING_FEE("Building");

SELECT * FROM NEW_STUDENT_HOUSING ORDER BY "StudentID";

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
8 rows affected.
Done.
Done.
8 rows affected.

[(100, 'Randoplh'),
 (200, 'Ingersoll'),
 (300, 'Randoplh'),
 (400, 'Randoplh'),
 (500, 'Pitkin'),
 (600, 'Ingersoll'),
 (700, 'Ingersoll'),
 (800, 'Pitkin')]

<h3>Boyce-Codd Normal Form (BCNF)</h3>
<ol>
    <li>Meets the conditions of 3NF</li>
    <li>A relation is in BCNM if every determinant is a candidate key</li>
</ol>
<h3>Example STUDENT_ADVISOR</h3>

In [42]:
%%sql
DROP TABLE IF EXISTS STUDENT_ADVISOR;

CREATE TABLE STUDENT_ADVISOR
(
	"StudentID"			INT,
	"Major" 			VARCHAR(30),
	"AdvisorName"		VARCHAR(30),
	CONSTRAINT			STUDENT_ADVISOR_PK			PRIMARY KEY("StudentID","Major")
);

INSERT INTO STUDENT_ADVISOR (
	"StudentID",
	"Major",
	"AdvisorName"
)
VALUES
(100, 'Math', 'Cauchy'),
(200, 'Psychology', 'Jung'),
(300, 'Math', 'Riemann'),
(400, 'Math', 'Cauchy'),
(500, 'Psychology', 'Perls'),
(600, 'English', 'Austin'),
(700, 'Psychology', 'Perls'),
(700, 'Math', 'Riemann'),
(800, 'Math', 'Cauchy'),
(800, 'Psychology', 'Jung');

SELECT * FROM STUDENT_ADVISOR;

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
Done.
10 rows affected.
10 rows affected.

[(100, 'Math', 'Cauchy'),
 (200, 'Psychology', 'Jung'),
 (300, 'Math', 'Riemann'),
 (400, 'Math', 'Cauchy'),
 (500, 'Psychology', 'Perls'),
 (600, 'English', 'Austin'),
 (700, 'Psychology', 'Perls'),
 (700, 'Math', 'Riemann'),
 (800, 'Math', 'Cauchy'),
 (800, 'Psychology', 'Jung')]

<p>
Consider the relation STUDENT_ADVISOR, where a student (StudentID) can have one or more majors (Major), a major can have one or more faculty advisors (AdvisorName), and a faculty member advises in only one major area. Note that the figure shows two students (StudentIDs 700 and 800) with double majors (both students show Majors of Math and Psychology) and two Subjects (Math and Psychology) with two Advisors.
</p>
<p>
Because students can have several majors, StudentID does not determine Major. Moreover, because students can have several advisors, StudentID does not determine AdvisorName. Therefore, StudentID by itself cannot be a key. However, the composite key (StudentID, Major) determines AdvisorName, and the composite key (StudentID, AdvisorName) determines Major.<br><br>
(StudentID, Major) &#8594; AdvisorName<br><br>
(StudentID, AdvisorName) &#8594; Major<br><br>

This gives us (StudentID, Major) and (StudentID, AdvisorName) as two candidate keys. We can select either of these as the primary key for the relation. Thus, two STUDENT_ADVISOR schemas with different candidate keys are possible:<br><br>
STUDENT_ADVISOR (<u>StudentID</u>, <u>Major</u>, AdvisorName)<br><br>
and<br><br>
STUDENT_ADVISOR (<u>StudentID</u>, Major, <u>AdvisorName</u>)<br><br>
</p>
<p>
Further, assume that this row
is the only one in the table with the AdvisorName value of Perls. If we delete this row, we will lose all data about Perls. This is a deletion anomaly. Similarly, we cannot insert the data to represent the Economics advisor Keynes until a student majors in Economics. This is an insertion anomaly. Situations like this led to the development of BCNF. What do we do with the STUDENT_ADVISOR relation? As before, we move the functional dependency creating the problem to another relation while leaving the determinant in the original relation as a foreign key. In this case, we will create the relations:<br><br>
STUDENT_ADVISOR (<u>StudentID</u>, <u>AdvisorName</u>)<br><br>
ADVISOR_MAJOR (<u>AdvisorName</u>, Major)
</p>

In [43]:
%%sql
DROP TABLE IF EXISTS ADVISOR_MAJOR CASCADE;

SELECT DISTINCT
"AdvisorName",
"Major"
INTO ADVISOR_MAJOR
FROM STUDENT_ADVISOR;

ALTER TABLE ADVISOR_MAJOR
    ADD CONSTRAINT ADVISOR_MAJOR_PK 
        PRIMARY KEY("AdvisorName");

SELECT * FROM ADVISOR_MAJOR;

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
5 rows affected.
Done.
5 rows affected.

[('Jung', 'Psychology'),
 ('Perls', 'Psychology'),
 ('Cauchy', 'Math'),
 ('Austin', 'English'),
 ('Riemann', 'Math')]

In [44]:
%%sql
DROP TABLE IF EXISTS NEW_STUDENT_ADVISOR;

SELECT DISTINCT
"StudentID",
"AdvisorName"
INTO NEW_STUDENT_ADVISOR
FROM STUDENT_ADVISOR;

ALTER TABLE NEW_STUDENT_ADVISOR
    ADD CONSTRAINT NEW_STUDENT_ADVISOR_PK 
        PRIMARY KEY("StudentID", "AdvisorName");

ALTER TABLE NEW_STUDENT_ADVISOR
    ADD CONSTRAINT NEW_STUDENT_ADVISOR_FK 
        FOREIGN KEY("AdvisorName")
        REFERENCES ADVISOR_MAJOR("AdvisorName");

SELECT * FROM NEW_STUDENT_ADVISOR ORDER BY "StudentID";

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
10 rows affected.
Done.
Done.
10 rows affected.

[(100, 'Cauchy'),
 (200, 'Jung'),
 (300, 'Riemann'),
 (400, 'Cauchy'),
 (500, 'Perls'),
 (600, 'Austin'),
 (700, 'Riemann'),
 (700, 'Perls'),
 (800, 'Cauchy'),
 (800, 'Jung')]

<h3>Process for Putting a Relation into BCNF</h3>
<ol>
    <li>Identify every functional dependency</li>
    <li>Identify every candidate key</li>
    <li>If there is a functional dependency that has a determinant that is not a candidate key:</li>
        <ol type="A">
            <li>Move the columns of that functional dependency into a new relation</li>
            <li>Make the determinant of that functional dependency the primary key of the new relation</li>
            <li>Leave a copy of the determinant as a foreign key in the original relation</li>
            <li>Create a referential integrity constraint between the original relation and the new relation</li>
        </ol>
    <li> Repeat step 3 until every determinant of every relation is a candidate key</li>
</ol>
<p><strong>
"I swear to construct my tables so that all non-key columns are dependent on the key, the whole key and nothing but the key, so help me Codd!"</strong></p>
<pre>
the key &#8594;                     [This is 1NF]
the whole key &#8594;               [This is 2NF]
and nothing but the key &#8594;     [This is 3NF and BCNF]
</pre>
<h3>Exercise</h3>

In [45]:
%%sql
DROP TABLE IF EXISTS SKU_DATA;

CREATE TABLE SKU_DATA 
(
	"SKU"   			    Integer 	      	NOT NULL,
	"SKU_Description"   	Char (35) 	    	NOT NULL,
	"Department"  	    	Char (30)       	NOT NULL,
	"Buyer"  			    Char (35)       	NULL,
	CONSTRAINT 		    	SKU_DATA_PK     	PRIMARY KEY ("SKU")
);

INSERT INTO SKU_DATA 
VALUES 
(100100, 'Std. Scuba Tank, Yellow', 'Water Sports', 'Pete Hansen'),
(100200, 'Std. Scuba Tank, Magenta', 'Water Sports', 'Pete Hansen'),
(100300, 'Std. Scuba Tank, Light Blue', 'Water Sports', 'Pete Hansen'),
(100400, 'Std. Scuba Tank, Dark Blue', 'Water Sports', 'Pete Hansen'),
(100500, 'Std. Scuba Tank, Light Green', 'Water Sports', 'Pete Hansen'),
(100600, 'Std. Scuba Tank, Dark Green', 'Water Sports', 'Pete Hansen'),
(101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers'),
(101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers'),
(201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),		
(202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
(203000, 'Half-dome Tent Vestibule - Wide', 'Camping', 'Cindy Lo'),
(301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),		
(302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin');

SELECT * FROM SKU_DATA;

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
Done.
13 rows affected.
13 rows affected.

[(100100, 'Std. Scuba Tank, Yellow            ', 'Water Sports                  ', 'Pete Hansen                        '),
 (100200, 'Std. Scuba Tank, Magenta           ', 'Water Sports                  ', 'Pete Hansen                        '),
 (100300, 'Std. Scuba Tank, Light Blue        ', 'Water Sports                  ', 'Pete Hansen                        '),
 (100400, 'Std. Scuba Tank, Dark Blue         ', 'Water Sports                  ', 'Pete Hansen                        '),
 (100500, 'Std. Scuba Tank, Light Green       ', 'Water Sports                  ', 'Pete Hansen                        '),
 (100600, 'Std. Scuba Tank, Dark Green        ', 'Water Sports                  ', 'Pete Hansen                        '),
 (101100, 'Dive Mask, Small Clear             ', 'Water Sports                  ', 'Nancy Meyers                       '),
 (101200, 'Dive Mask, Med Clear               ', 'Water Sports                  ', 'Nancy Meyers                       '),
 (201000, 'Half-dome Tent                     ', 'Camping                       ', 'Cindy Lo                           '),
 (202000, 'Half-dome Tent Vestibule           ', 'Camping                       ', 'Cindy Lo                           '),
 (203000, 'Half-dome Tent Vestibule - Wide    ', 'Camping                       ', 'Cindy Lo                           '),
 (301000, 'Light Fly Climbing Harness         ', 'Climbing                      ', 'Jerry Martin                       '),
 (302000, 'Locking Carabiner, Oval            ', 'Climbing                      ', 'Jerry Martin                       ')]

<strong>Functional dependencies:</strong>
<p>
sku &#8594; (sku_description, department, buyer)<br>
sku_description &#8594; (department, buyer)<br>
buyer &#8594; department
</p>
<strong>Candidate keys:</strong>
<p>
sku<br>
sku_description
</p>
<strong>Issue:</strong>
<p>
Buyer is not a canditate key but has a functional dependency to department
</p>
<strong>Solution:</strong>
<p>
Transform:<br>
SKU_DATA (<u>SKU</u>, SKU_Description, Department, Buyer)<br>
to<br>
SKU_DATA_2 (<u>SKU</u>, SKU_Description, Buyer)<br>
BUYER_2 (<u>Buyer</u>, Department)
</p>

In [46]:
%%sql
DROP TABLE IF EXISTS BUYER_2 CASCADE;

SELECT DISTINCT
"Buyer",
"Department"
INTO BUYER_2
FROM SKU_DATA;

ALTER TABLE BUYER_2
    ADD CONSTRAINT BUYER_2_PK 
        PRIMARY KEY("Buyer");

SELECT * FROM BUYER_2;

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
4 rows affected.
Done.
4 rows affected.

[('Cindy Lo                           ', 'Camping                       '),
 ('Nancy Meyers                       ', 'Water Sports                  '),
 ('Jerry Martin                       ', 'Climbing                      '),
 ('Pete Hansen                        ', 'Water Sports                  ')]

In [47]:
%%sql
DROP TABLE IF EXISTS SKU_DATA_2;

SELECT DISTINCT
"SKU",
"SKU_Description",
"Buyer"
INTO SKU_DATA_2
FROM SKU_DATA;

ALTER TABLE SKU_DATA_2
    ADD CONSTRAINT SKU_DATA_2_PK
        PRIMARY KEY("SKU");

ALTER TABLE SKU_DATA_2
    ADD CONSTRAINT SKU_DATA_2_FK 
        FOREIGN KEY("Buyer")
        REFERENCES Buyer_2("Buyer");

SELECT * FROM SKU_DATA_2 ORDER BY "SKU";

 * postgresql://dbadmin:***@postgresaws.cxs3jiupff9j.eu-central-1.rds.amazonaws.com:5432/sandbox
Done.
13 rows affected.
Done.
Done.
13 rows affected.

[(100100, 'Std. Scuba Tank, Yellow            ', 'Pete Hansen                        '),
 (100200, 'Std. Scuba Tank, Magenta           ', 'Pete Hansen                        '),
 (100300, 'Std. Scuba Tank, Light Blue        ', 'Pete Hansen                        '),
 (100400, 'Std. Scuba Tank, Dark Blue         ', 'Pete Hansen                        '),
 (100500, 'Std. Scuba Tank, Light Green       ', 'Pete Hansen                        '),
 (100600, 'Std. Scuba Tank, Dark Green        ', 'Pete Hansen                        '),
 (101100, 'Dive Mask, Small Clear             ', 'Nancy Meyers                       '),
 (101200, 'Dive Mask, Med Clear               ', 'Nancy Meyers                       '),
 (201000, 'Half-dome Tent                     ', 'Cindy Lo                           '),
 (202000, 'Half-dome Tent Vestibule           ', 'Cindy Lo                           '),
 (203000, 'Half-dome Tent Vestibule - Wide    ', 'Cindy Lo                           '),
 (301000, 'Light Fly Climbing Harness         ', 'Jerry Martin                       '),
 (302000, 'Locking Carabiner, Oval            ', 'Jerry Martin                       ')]